# This file was created by the command:
# /home/shahruk/git/kaldi/egs/wsj/s5/steps/nnet3/xconfig_to_configs.py --xconfig-file /media/shahruk/terra2x/cobalt2/exp/20211128-plda-in-tensorflow/kaldi-xvector-diarization-tflite/lib/testdata/tdnn/src/tdnn_single_layer/configs/network.xconfig --config-dir /media/shahruk/terra2x/cobalt2/exp/20211128-plda-in-tensorflow/kaldi-xvector-diarization-tflite/lib/testdata/tdnn/src/tdnn_single_layer/configs/
# It contains the entire neural network.

input-node name=input dim=30
component name=tdnn1.affine type=NaturalGradientAffineComponent input-dim=120 output-dim=32  max-change=0.75
component-node name=tdnn1.affine component=tdnn1.affine input=Append(Offset(input, -3), Offset(input, -1), input, Offset(input, 1))
component name=tdnn1.relu type=RectifiedLinearComponent dim=32 self-repair-scale=1e-05
component-node name=tdnn1.relu component=tdnn1.relu input=tdnn1.affine
output-node name=output input=tdnn1.relu objective=linear
